<?php

return [
    'bik'   => 'Поле :attribute не соответствует формату БИК.',
    'rs'    => 'Поле :attribute должно быть действительным расчётным счётом.',
    'ks'    => 'Поле :attribute должно быть действительным корреспондентским счётом.',
    'kpp'   => 'Поле :attribute не соответствует формату КПП.',
    'oms'   => 'Поле :attribute должно быть действительным ОМС.',
    'snils' => 'Поле :attribute должно быть действительным СНИЛС.',
    'ogrn' => [
        'all'   => 'Поле :attribute должно быть действительным ОГРН или ОГРНИП.',
        'ip'    => 'Поле :attribute должно быть действительным ОГРНИП.',
        'legal' => 'Поле :attribute должно быть действительным ОГРН.',
    ],
    'inn' => [
        'all'    => 'Поле :attribute должно быть действительным ИНН.',
        'person' => 'Поле :attribute должно быть действительным личным ИНН.',
        'legal'  => 'Поле :attribute должно быть действительным юридическим ИНН.',
    ],
];
